Revit 2027 API
ProjectBrowserOptions.ShowViewPlacementOnSheetStatusIcons Property
 Show the icons indicating view placement on sheet status.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowViewPlacementOnSheetStatusIcons { get; set; }
Public Property ShowViewPlacementOnSheetStatusIcons As Boolean
	Get
	Set
public:
property bool ShowViewPlacementOnSheetStatusIcons {
	bool get ();
	void set (bool value);
}
member ShowViewPlacementOnSheetStatusIcons : bool with get, set
Property Value
Boolean
Remarks
 If true, the icons indicating view placement on sheet status will be shown at every view or schedule node in the Project Browser. If false, the icons indicating view placement on sheet status will not be shown.
See Also
Reference
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace